#+DATE: <2014-09-02 Tue>
#+OPTIONS: texht:t
#+LATEX_CLASS: snm-article
#+LATEX_CLASS_OPTIONS: [12pt]
#+LATEX_HEADER:
#+LATEX_HEADER_EXTRA:


** Force path to be consistent with terminal path

The mac behaves increasingly weird with relation to how paths are
being set in the terminal and in programs launched by  launchd (or by
extension Alfred).

In order to combat this I stole a trick from the Emacs wiki where the
path is obtained from a login shell, so it is guaranteed to be
consistent with the terminal. This will minimize surprises since I
like my editing environment to be identical to the shell environment.

#+BEGIN_SRC emacs-lisp
  (defun set-exec-path-from-shell-PATH ()
    "Sets the exec-path to the same value used by the user shell"
    (let ((path-from-shell
           (replace-regexp-in-string
            "[[:space:]\n]*$" ""
            (shell-command-to-string "$SHELL -l -c 'echo $PATH'"))))
      (setenv "PATH" path-from-shell)
      (setq exec-path (split-string path-from-shell path-separator))))

  ;; call function now
  (set-exec-path-from-shell-PATH)

#+END_SRC

#+RESULTS:
| /usr/local/bin | /usr/local/sbin | /usr/bin | /bin | /usr/sbin | /sbin | /opt/X11/bin | /usr/local/MacGPG2/bin | /Library/TeX/texbin | /usr/local/heroku/bin | /Users/pti/.sdkman/candidates/lazybones/current/bin | /Users/pti/.rvm/gems/ruby-2.1.2/bin | /Users/pti/.rvm/gems/ruby-2.1.2@global/bin | /Users/pti/.rvm/rubies/ruby-2.1.2/bin | /Users/pti/playpen/go/bin | /usr/local/opt/go/libexec/bin | /Users/pti/.rvm/bin | /Users/pti/bin | /Users/pti/.cargo/bin | /Users/pti/anaconda3/bin |


Tip: run the code above with C-C C-C to see the actual path being set
in the *RESULTS*.

** Setup registers for easy file access

Registers allow to quickly access stuff, in this case files.

Access the files using

 - C-x r j <register>

e.g.

 - C-x r j s  : access ~/.emacs.d/snamellit.org
 - C-x r j z  : open ~/.zshrc
 - C-x r j m  : open ~/org/melexis/melexis.org


#+BEGIN_SRC emacs-lisp
  (set-register ?s (cons 'file "~/.emacs.d/snamellit.org"))
  (set-register ?z (cons 'file "~/.zshrc"))
  (set-register ?m (cons 'file "~/org/melexis/melexis.org"))
#+END_SRC

#+RESULTS:
: (file . ~/org/melexis/melexis.org)

**** Grep in find files

Within the find-files you can activate a grep with C-s.

- C-s : grep in files
- C-u C-s : grep in directory tree like rgrep

The following snippet uses ack instead of grep for improved
responsiveness.

#+BEGIN_SRC emacs-lisp
(when (executable-find "ack-grep")
(setq helm-grep-default-command "ack-grep -Hn --no-group --no-color %e %p %f"
    helm-grep-default-recurse-command
    "ack-grep -H --no-group --no-color %e %p %f"))
(when (executable-find "ack")
(setq helm-grep-default-command "ack -Hn --no-group --no-color %e %p %f"
    helm-grep-default-recurse-command
    "ack -H --no-group --no-color %e %p %f"))
#+END_SRC

#+RESULTS:
: ack -H --no-group --no-color %e %p %f

** Auto Completion

#+BEGIN_SRC emacs-lisp
  (require-packages 'company)
  (add-hook 'after-init-hook 'global-company-mode)
#+END_SRC

#+RESULTS:
| global-company-mode |

** GNU Global tags

#+BEGIN_SRC emacs-lisp
  (require-packages 'ggtags)
  (add-hook 'c-mode-common-hook
            (lambda ()
              (when (derived-mode-p 'c-mode 'c++-mode 'java-mode)
                (ggtags-mode 1))))
#+END_SRC

#+RESULTS:
| lambda | nil | (when (derived-mode-p (quote c-mode) (quote c++-mode) (quote java-mode)) (ggtags-mode 1)) |




#+BEGIN_SRC emacs-lisp
(message "general done.")
#+END_SRC

*** js2-mode

For javascript, Steve Yegge's js2-mode is recommended over the version shipped with emacs.

#+BEGIN_SRC emacs-lisp
  (require-packages 'js2-mode 'js2-refactor)

  (add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))
  (add-to-list 'interpreter-mode-alist '("node" . js2-mode))

  (setq js-indent-level 2)
  (setq js-indent-first-init "dynamic")

  (js2r-add-keybindings-with-prefix "C-c C-m")

  (add-hook 'js2-mode-hook
            (lambda ()
              (set (make-local-variable 'indent-tabs-mode) 'nil)
              (set (make-local-variable 'js-indent-level) 2)
              (set (make-local-variable 'tab-width) 2)
              (add-untabify-before-save)))

#+END_SRC

#+RESULTS:
| (lambda nil (set (make-local-variable (quote indent-tabs-mode)) (quote nil)) (set (make-local-variable (quote js-indent-level)) 2) (set (make-local-variable (quote tab-width)) 2) (add-untabify-before-save)) | (lambda nil (set (make-local-variable (quote indent-tabs-mode)) (quote nil)) (set (make-local-variable (quote tab-width)) 2) (add-untabify-before-save)) | skewer-mode | add-untabify-before-save | er/add-js2-mode-expansions | er/add-js-mode-expansions |

To customize how it works: *M-x customize-group RET js2-mode RET*.

I also enabled the js2-refactor package.

*** swank-js

see [[https://github.com/swank-js/swank-js][SwankJS github repo]] for more details.

Install Node.JS and npm using your favorite package manager.

Install swank-js from npm:

#+BEGIN_SRC sh
  npm install -g swank-js
#+END_SRC

Now enable swank-js in emacs

#+BEGIN_SRC emacs-lisp

  (global-set-key [f5] 'slime-js-reload)
  (add-hook 'js2-mode-hook
            (lambda ()
              (slime-js-minor-mode 1)))

  ;; for css mode support
  (add-hook 'css-mode-hook
            (lambda ()
              (define-key css-mode-map "\M-\C-x" 'slime-js-refresh-css)
              (define-key css-mode-map "\C-c\C-r" 'slime-js-embed-css)))

#+END_SRC

#+RESULTS:
| (lambda nil (define-key css-mode-map \230 (quote slime-js-refresh-css)) (define-key css-mode-map  (quote slime-js-embed-css))) | skewer-css-mode | add-untabify-before-save |


*** Paredit Mode

Paredit allows you to enter lisp code where it is actually impossible
to write syntax errors. With all the parentheses in lisp this is
actually one of the killer apps in Emacs.

Enable it when editing emacs lisp and also enable highlighting parens.

#+BEGIN_SRC emacs-lisp
(autoload 'paredit-mode "paredit"
   "Minor mode for pseudo-structurally editing Lisp code."
   t)
(add-hook 'emacs-lisp-mode-hook
        (lambda ()
          (paredit-mode +1)
          (show-paren-mode +1)
          (add-untabify-before-save)))

#+END_SRC

#+RESULTS:
| lambda | nil | (paredit-mode 1) | (show-paren-mode 1) |

** Elixir

Elixir has good tooling in emacs.

*elixir-mode* is actively maintained to add language support to emacs.

*alchemist* contains the elixir tooling integration. It provides
access to the *iex* shell, adds interactive help based on iex so it is
always accurate with the installed elixir, and of course support for
the *mix* build system.

The older *elixir-mix* package has been included in *alchemist* and is
now considered obsolete : it is no longer maintained.

There is a snippet collection in *elixir-yasnippets*

#+BEGIN_SRC emacs-lisp
;; elixir-mode : basic elixir editing support
;; elixir-yasnippets : predefined elixir snippets
;; alchemist : mix and other elixir tool integration
;; Note : elixir-mix is included in alchemist and obsolete now
(require-packages 'alchemist 'elixir-mode 'elixir-yasnippets)

;; add a hook to compile on save
(defun elixir-mode-compile-on-save ()
"Elixir mode compile files on save."
  (and (file-exists (buffer-file-name))
       (file-exists (elixir-mode-compiled-file-name))
           (elixir-cos-mode t)))
(add-hook 'elixir-mode-hook 'elixir-mode-compile-on-save)


;; enable to let mix run the test suite on save
(setq alchemist-hooks-test-on-save t)

#+END_SRC

#+RESULTS:
| elixir-mode-compile-on-save | alchemist-mode-hook |

** Web Templates

#+BEGIN_SRC emacs-lisp
  (require-packages 'web-mode)
  (add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.tpl\\.php\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.[gj]sp\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.as[cp]x\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.djhtml\\'" . web-mode))

  (add-hook 'web-mode-hook 'add-untabify-before-save)

  (setq web-mode-markup-indent-offset 2)
  (setq web-mode-css-indent-offset 2)
  (setq web-mode-code-indent-offset 2)

  (setq web-mode-style-padding 1)
  (setq web-mode-script-padding 1)

#+END_SRC

#+RESULTS:
: 1

** CSS

Set tabwidth to my preferred 2 spaces for CSS.

#+BEGIN_SRC emacs-lisp
(setq css-mode-indent-depth 2)

(add-hook 'css-mode-hook 'add-untabify-before-save)
#+END_SRC

#+RESULTS:
: 2

** Org Mode

#+BEGIN_SRC emacs-lisp
(setq org-directory "~/org")
#+END_SRC

#+RESULTS:
: ~/org

*** Capture templates

Add some templates for quick capture of things to organize.

The global keycode to add a thing is

- C-c c

This shows a nice menu with things to add. When choosing one of the
things a fill in template is provided.

- C-c C-c will file it once it is done.
- C-c C-w finalize by refiling it.
- C-c C-k abort the capture process.

#+BEGIN_SRC emacs-lisp

(setq org-default-notes-file (concat org-directory "/notes.org"))

#+END_SRC

The following template are provided:

- todo: a todo in refile.org
- note: a note in refile.org
- journal: a note in diary.org
- review: a review todo in refile.org
- phone: a phonec call
- habit: a habit entry

#+BEGIN_SRC emacs-lisp


#+END_SRC

#+RESULTS:
| t | todo         | entry | (file ~/org/refile.org)         | (concat * TODO %?\n %U\n %a\n   %i)                                                         | :clock-in         | t | :clock-resume | t |
| n | note         | entry | (file ~/org/refile.org)         | (concat * %? :NOTE:\n %U\n %a\n)                                                            |                   |   |               |   |
| j | Journal      | entry | (file+datetree ~/org/diary.org) | (concat * %?\n %U\n   %i)                                                                   | :clock-in         | t | :clock-resume | t |
| w | org-protocol | entry | (file ~/org/refile.org)         | (concat * TODO Review %c\n %U\n   %i)                                                       | :immediate-finish | t |               |   |
| p | Phone call   | entry | (file ~/org/refile.org)         | (concat * PHONE %? :PHONE:\n %U\n   %i\n)                                                   | :clock-in         | t | :clock-resume | t |
| h | Habit        | entry | (file ~/org/refile.org)         | (concat * TODO %?\n %U\n %a\n :SCHEDULED: %t\n :PROPERTIES:\n :STYLE: habit\n :END:\n   %i) |                   |   |               |   |

In these entries, the first string is the key to reach the template,
the second is a short description. Then follows the type of the entry
and a definition of the target location for storing the note. Finally,
the template itself, a string with %-escapes to fill in information
based on time and context.

When you call M-x org-capture, Org will prompt for a key to select the
template (if you have more than one template) and then prepare the
buffer

During expansion of the template, special %-escapes1 allow dynamic
insertion of content. Here is a small selection of the possibilities,
consult the manual for more.

- %a          annotation, the link created with org-store-link
- %i          initial content, region when capture is called with C-u.
- %t          timestamp, date only
- %T          timestamp with date and time
- %u, %U      like the above, but inactive timestamps

**** Add support for Snamellit classes

In order to simplify the creation of good looking documents for
Snamellit, I created a number of extensions of the standard latex
classes.

#+BEGIN_SRC emacs-lisp
(add-to-list 'org-latex-classes
           '("snm-article" "\\documentclass{snm-article}
[NO-DEFAULT-PACKAGES]
[NO-PACKAGES]"
             ("\\section{%s}" . "\\section*{%s}")
             ("\\subsection{%s}" . "\\subsection*{%s}")
             ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
             ("\\paragraph{%s}" . "\\paragraph*{%s}")
             ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

(add-to-list 'org-latex-classes
           '("snm-report" "\\documentclass{snm-report}
[NO-DEFAULT-PACKAGES]
[NO-PACKAGES]"
             ("\\part{%s}" . "\\part*{%s}")
             ("\\chapter{%s}" . "\\chapter*{%s}")
             ("\\section{%s}" . "\\section*{%s}")
             ("\\subsection{%s}" . "\\subsection*{%s}")
             ("\\subsubsection{%s}" . "\\subsubsection*{%s}")))

(add-to-list 'org-latex-classes
           '("snm-report" "\\documentclass{snm-report}
[NO-DEFAULT-PACKAGES]
[NO-PACKAGES]"
             ("\\part{%s}" . "\\part*{%s}")
             ("\\chapter{%s}" . "\\chapter*{%s}")
             ("\\section{%s}" . "\\section*{%s}")
             ("\\subsection{%s}" . "\\subsection*{%s}")
             ("\\subsubsection{%s}" . "\\subsubsection*{%s}")))

(add-to-list 'org-latex-classes
           '("snm-book" "\\documentclass{snm-book}
[NO-DEFAULT-PACKAGES]
[NO-PACKAGES]"
             ("\\part{%s}" . "\\part*{%s}")
             ("\\chapter{%s}" . "\\chapter*{%s}")
             ("\\section{%s}" . "\\section*{%s}")
             ("\\subsection{%s}" . "\\subsection*{%s}")
             ("\\subsubsection{%s}" . "\\subsubsection*{%s}")))

(add-to-list 'org-latex-classes
           '("snm-beamer" "\\documentclass{snm-beamer}
[NO-DEFAULT-PACKAGES]
[NO-PACKAGES]"
             ("\\section{%s}" . "\\section*{%s}")
             ("\\subsection{%s}" . "\\subsection*{%s}")
             ("\\subsubsection{%s}" . "\\subsubsection*{%s}")))

#+END_SRC

#+RESULTS:
| snm-beamer  | \documentclass{snm-beamer}\n  [NO-DEFAULT-PACKAGES]\n  [NO-PACKAGES]  | (\section{%s} . \section*{%s}) | (\subsection{%s} . \subsection*{%s}) | (\subsubsection{%s} . \subsubsection*{%s}) |                                      |                                            |
| snm-book    | \documentclass{snm-book}\n  [NO-DEFAULT-PACKAGES]\n  [NO-PACKAGES]    | (\part{%s} . \part*{%s})       | (\chapter{%s} . \chapter*{%s})       | (\section{%s} . \section*{%s})             | (\subsection{%s} . \subsection*{%s}) | (\subsubsection{%s} . \subsubsection*{%s}) |
| snm-report  | \documentclass{snm-report}\n  [NO-DEFAULT-PACKAGES]\n  [NO-PACKAGES]  | (\part{%s} . \part*{%s})       | (\chapter{%s} . \chapter*{%s})       | (\section{%s} . \section*{%s})             | (\subsection{%s} . \subsection*{%s}) | (\subsubsection{%s} . \subsubsection*{%s}) |
| snm-article | \documentclass{snm-article}\n  [NO-DEFAULT-PACKAGES]\n  [NO-PACKAGES] | (\section{%s} . \section*{%s}) | (\subsection{%s} . \subsection*{%s}) | (\subsubsection{%s} . \subsubsection*{%s}) | (\paragraph{%s} . \paragraph*{%s})   | (\subparagraph{%s} . \subparagraph*{%s})   |
| mlx-beamer  | \documentclass{mlx-beamer}\n  [NO-DEFAULT-PACKAGES]\n  [NO-PACKAGES]  | (\section{%s} . \section*{%s}) | (\subsection{%s} . \subsection*{%s}) | (\subsubsection{%s} . \subsubsection*{%s}) |                                      |                                            |
| mlx-book    | \documentclass{mlx-book}\n  [NO-DEFAULT-PACKAGES]\n  [NO-PACKAGES]    | (\part{%s} . \part*{%s})       | (\chapter{%s} . \chapter*{%s})       | (\section{%s} . \section*{%s})             | (\subsection{%s} . \subsection*{%s}) | (\subsubsection{%s} . \subsubsection*{%s}) |
| mlx-report  | \documentclass{mlx-report}\n  [NO-DEFAULT-PACKAGES]\n  [NO-PACKAGES]  | (\part{%s} . \part*{%s})       | (\chapter{%s} . \chapter*{%s})       | (\section{%s} . \section*{%s})             | (\subsection{%s} . \subsection*{%s}) | (\subsubsection{%s} . \subsubsection*{%s}) |
| mlx-article | \documentclass{mlx-article}\n  [NO-DEFAULT-PACKAGES]\n  [NO-PACKAGES] | (\section{%s} . \section*{%s}) | (\subsection{%s} . \subsection*{%s}) | (\subsubsection{%s} . \subsubsection*{%s}) | (\paragraph{%s} . \paragraph*{%s})   | (\subparagraph{%s} . \subparagraph*{%s})   |
| beamer      | \documentclass[presentation]{beamer}                                  | (\section{%s} . \section*{%s}) | (\subsection{%s} . \subsection*{%s}) | (\subsubsection{%s} . \subsubsection*{%s}) |                                      |                                            |
| article     | \documentclass[11pt]{article}                                         | (\section{%s} . \section*{%s}) | (\subsection{%s} . \subsection*{%s}) | (\subsubsection{%s} . \subsubsection*{%s}) | (\paragraph{%s} . \paragraph*{%s})   | (\subparagraph{%s} . \subparagraph*{%s})   |
| report      | \documentclass[11pt]{report}                                          | (\part{%s} . \part*{%s})       | (\chapter{%s} . \chapter*{%s})       | (\section{%s} . \section*{%s})             | (\subsection{%s} . \subsection*{%s}) | (\subsubsection{%s} . \subsubsection*{%s}) |
| book        | \documentclass[11pt]{book}                                            | (\part{%s} . \part*{%s})       | (\chapter{%s} . \chapter*{%s})       | (\section{%s} . \section*{%s})             | (\subsection{%s} . \subsection*{%s}) | (\subsubsection{%s} . \subsubsection*{%s}) |

**** Source Code Highlighting

Since I deal with a lot of source-code I like to have it nicely formatted.
One of the best ways is to use the minted option which uses the python
*pygmentize* script. This program must be installed and on the
standard search path.

#+BEGIN_SRC emacs-lisp
  ;; Setup minted fancy listings
  (setq org-latex-listings 'minted)
  (setq org-latex-custom-lang-environments
      '(
  ;;      (emacs-lisp "common-lispcode")
        ))
  (setq org-latex-minted-options
      '(("frame" "lines")
        ("fontsize" "\\scriptsize")
        ("linenos" "")
        ("breaklines" "true")
        ("breakanywhere" "true")))

  ;; Add -shell-escape to enable pygmentize to be called
  (let ((cmd (mapconcat
            'identity
            '("lualatex"
              "-shell-escape"
              "-interaction nonstopmode"
              "-output-directory %o"
              "%f")
            " ")))
  (setq
   org-latex-pdf-process
   ;; run command 3x to update indexes and such
   (list cmd cmd cmd)))
#+END_SRC

#+RESULTS:
| lualatex -shell-escape -interaction nonstopmode -output-directory %o %f | lualatex -shell-escape -interaction nonstopmode -output-directory %o %f | lualatex -shell-escape -interaction nonstopmode -output-directory %o %f |

**** jira integration
#+BEGIN_SRC emacs-lisp
  (require-packages 'org-jira)
  (setq jiralib-url "https://jira.melexis.com/jira")
  (setq org-jira-working-dir "~/org/melexis/jira")

#+END_SRC

#+RESULTS:
: ~/org/melexis/jira

**** taskjuggler project management

The taskjuggler is an export target in the contrib folder.

#+BEGIN_SRC emacs-lisp
  (let ((tj3-file "~/.emacs.d/vendor/org-mode/contrib/lisp/ox-taskjuggler.el"))
    (when (file-exists-p tj3-file)
      (load-file tj3-file)
      (add-to-list 'org-export-backends 'taskjuggler)))
#+END_SRC

#+RESULTS:
| taskjuggler | ascii | html | icalendar | latex |

*** Get the connection to the docker environment

#+BEGIN_SRC emacs-lisp
  (defun snam/clean-docker-env-value (s)
    "the values are escaped with quotes which have to
     be removed for our use"
    (replace-regexp-in-string "\\\"" "" s))

  (defun snam/docker-environment (script)
    "remove the export statements from the lines which
     were actually intended to be interpreted by bash"
    (mapcar
     (lambda (l)
       (message l)
       (let* ((kv (split-string l "="))
              (key (car kv))
              (val (snam/clean-docker-env-value (cadr kv))))
         (cons key val)))
     (mapcar
      (lambda (s)
        (cadr (split-string s "[ ]+")))                 ; remove export part
      (remove-if-not                                    ; only keep env vars
       (lambda (s) (string-prefix-p "export" s))        ; from output of cmd
       (split-string script "[\r\n]+")))))

  (defun docker-init ()
    "check if docker-machine is on the path and get the
    expected environment from there to allow docker to find
    the docker daemon."
    (message "initializing docker...")
    (let* ((eval-script (shell-command-to-string "docker-machine env dev"))
           (docker-env (snam/docker-environment eval-script)))

      (loop for (key . val) in docker-env
            collect (setenv key val))))

  (docker-init)


#+END_SRC

#+RESULTS:
| 1 | tcp://192.168.99.100:2376 | /Users/pti/.docker/machine/machines/dev | dev |

